Repository: caetanv/Samplemed-Blog
Catalog: app/Plugin/migrations/Locale/fre/LC_MESSAGES/migrations.po
Languages: fr

source: Sorry, I can't downgrade. Why would you want that anyways?
fr: Désolé, je ne peux pas rétrograder. Pourquoi voudriez-vous que de toute façon?

source: No migrations available.
fr: Aucune migration disponible.

source: Running migrations:
fr: Exécution des migrations :

source: Migration will run dry, no database changes will be made
fr: Migration va fonctionner à sec, pas de changement de base de données seront effectués

source: All migrations have completed.
fr: Toutes les migrations ont été exécutées.

source: An error occurred when processing the migration:
fr: Une erreur est apparue lors de l'exécution de la migration :

source: Error: %s
fr: Erreur : %s

source: Do you want to mark the migration as successful?. [y]es or [a]bort.
fr: Voulez-vous marquer la migration réussie ? [y] oui ou [a]vorter.

source: Not a valid migration version.
fr: Version de migration invalide.

source: Please choose which version you want to migrate to. [q]uit or [c]lean.
fr: Veuillez choisir la version vers laquelle vous souhaitez migrer. [q]uitter ou [c] pour nettoyer

source: Do you want to compare the schema.php file to the database?
fr: Voulez vous comparer le fichier schema.php à la base de données ?

source: No database changes detected.
fr: Aucun changement de base de données détectées.

source: Do you want to generate a dump from the current database?
fr: Voulez vous générer un dump de votre base de données actuelle ?

source: Comparing schema.php to the database...
fr: Comparaison de schema.php à la base de données ...

source: Generating dump from the current database...
fr: Génération d'un dump de la base de données actuelle ...

source: Generating Migration...
fr: Génération de la Migration ...

source: Done.
fr: Exécuté.

source: Please enter the descriptive name of the migration to generate:
fr: Veuillez entrer le nom décrivant la migration à générer :

source: Current version:
fr: Version actuelle :

source: None applied.
fr: Aucune appliquée.

source: Latest version:
fr: Dernière version :

source: Current migration version:
fr: Version actuelle de la Migration :

source: Available migrations:
fr: Migrations disponibles :

source: applied
fr: appliquée

source: not applied
fr: non appliquée

source: Missing required argument 'name' for migration
fr: Nécessaire argument 'nom' de la migration manquant

source: Migration precheck class (%s) could not be loaded.
fr: Migration classe de précontrôle (%s) n'a pas pu être chargé.

source: Migration direction (%s) is not one of valid directions.
fr: La direction de la Migration (%s) ne fait pas partie des directions valides.

source: Migration action type (%s) is not one of valid actions type.
fr: Le type d'action de la Migration (%s) ne fait pas partie des type d'actions valides.

source: SQL Error: %s
fr: Erreur SQL : %s

source: Interrupted when running "%s" callback.
fr: Interrompu lors de l'exécution du callback "%s".

source: Class `%1$s` not found on file `%2$s` for %3$s.
fr: Classe `%1$s` introuvable dans le fichier `%2$s` pour %3$s.

source: File `%1$s` not found in the %2$s.
fr: Fichier `%1$s` introuvable dans %2$s.

source: Table "%s" does not exist in database.
fr: La table "%s" n'existe pas dans la base de données.

source: Table "%s" already exists in database.
fr: La table "%s" existe déjà dans la base de données.

source: Field "%s" does not exist in "%s".
fr: Le champ "%s" n'existe pas dans "%s".

source: Field "%s" already exists in "%s".
fr: Le champ "%s" existe déjà dans "%s".
