Repository: caetanv/Samplemed-Blog
Catalog: app/Plugin/migrations/Locale/por/LC_MESSAGES/migrations.po
Languages: pt_br

source: Sorry, I can't downgrade. Why would you want that anyways?
pt_br: Desculpe, eu não posso fazer o downgrade. Por que você quer que de qualquer maneira?

source: No migrations available.
pt_br: Nenhuma migração disponível.

source: Running migrations:
pt_br: Rodando migrações:

source: Migration will run dry, no database changes will be made
pt_br: Migração secará, sem alterações de banco de dados será feita

source: All migrations have completed.
pt_br: Todas as migrações foram completas.

source: An error occurred when processing the migration:
pt_br: Aconteceu um erro enquanto processava a migração:

source: Migration: %s
pt_br: Migração: %s

source: Error: %s
pt_br: Erro: %s

source: Do you want to mark the migration as successful?. [y]es or [a]bort.
pt_br: Você quer marcar a migração tão bem sucedido ?. [y] sim ou [a]bortar.

source: Not a valid migration version.
pt_br: Não é uma versão de migração válida,

source: Please choose which version you want to migrate to. [q]uit or [c]lean.
pt_br: Por favor, escolha para qual versão você deseja migrar. [q]uit ou [c]lean.

source: Do you want to compare the schema.php file to the database?
pt_br: Você deseja comparar o arquivo schema.php com o banco de dados?

source: Do you want to generate a dump from the current database?
pt_br: Você deseja gerar um dump do banco de dados atual?

source: Comparing schema.php to the database...
pt_br: Comparando schema.php com o banco de dados...

source: Generating migration from commandline arguments...
pt_br: Gerando migração de argumentos de linha de comando ...

source: Generating dump from the current database...
pt_br: Gerando dump do banco de dados atual...

source: Generating Migration...
pt_br: Gerando Migração...

source: Done.
pt_br: Feito.

source: Please enter the descriptive name of the migration to generate:
pt_br: Por favor entre com um nome descritivo para a migração a ser gerada:

source: Current version:
pt_br: Versão atual:

source: None applied.
pt_br: Nenhuma aplicada.

source: Latest version:
pt_br: Última versão:

source: Current migration version:
pt_br: Versão de Migração atual:

source: Available migrations:
pt_br: Migrações disponíveis:

source: applied
pt_br: aplicada

source: not applied
pt_br: não aplicada

source: Missing required argument 'name' for migration
pt_br: Faltando exigido argumento 'nome' para migração

source: Migration precheck class (%s) could not be loaded.
pt_br: Migração classe pré-verificação (%s) não pôde ser carregado.

source: Migration direction (%s) is not one of valid directions.
pt_br: Direção da Migração (%s) não é uma das direções válidas.

source: Migration action type (%s) is not one of valid actions type.
pt_br: Tipo de ação (%s) da Migração não é um dos tipos de ações válidos.

source: SQL Error: %s
pt_br: Erro SQL: %s

source: Interrupted when running "%s" callback.
pt_br: Interrompido enquanto rodava o callback "%s".

source: Class `%1$s` not found on file `%2$s` for %3$s.
pt_br: Classe `%1$s` não encontrado no arquivo `%2$s` para %3$s.

source: File `%1$s` not found in the %2$s.
pt_br: Arquivo `%1$s` não encontrada no %2$s.

source: Table "%s" does not exist in database.
pt_br: Table "%s" não existe no banco de dados.

source: Table "%s" already exists in database.
pt_br: Tabela "%s" já existe no banco de dados.

source: Field "%s" does not exist in "%s".
pt_br: Coluna "%s" não existe em "%s".

source: Field "%s" already exists in "%s".
pt_br: Coluna "%s" já existe em "%s".
